In [2]:
people = {
    'first':['Corey','Jane','John','Adam'],
    'last':['Schafer','Doe','Doe','Doe'],
    'email':['CoreyMSchafer@email.com','JaneDoe@email.com','JohnDoe@email.com','A@gmail.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@gmail.com

In [6]:
#order in sorting follows from last to first
df.sort_values(by=['last','first'],ascending = False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
3   Adam      Doe              A@gmail.com

In [7]:
df.sort_values(by=['first'],ascending = True,inplace = False)

   first     last                    email
3   Adam      Doe              A@gmail.com
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [8]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@gmail.com

In [22]:
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@gmail.com

In [23]:
df.sort_values(by=['first','last'],ascending=[True,False])

   first     last                    email
3   Adam      Doe              A@gmail.com
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [ ]:
df